Tekla Open API Reference for Tekla Structures 2025
ModificationInfo Structure
Modification info returned by History.
 Namespace: Tekla.Structures.Model.History
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public struct ModificationInfo
<SerializableAttribute>
Public Structure ModificationInfo
The ModificationInfo type exposes the following members.
Fields
Name | Description
Deleted
List of objects which have been deleted
Modified
List of objects which have been modified or created. Objects which have only attribute (UDA) changed, and/or which has been numbered since last take are excluded.
ModifiedWithInfo
 The modified objects with information of modification type. Objects which have only attribute (UDA) changed, and/or which has been numbered since last take are included.
Top
See Also
Reference
Tekla.Structures.Model.History Namespace